namespace net
{
	namespace sockets {
		namespace AddressFamily {
			//
			// Сводка:
			//     Задает схему адресации, экземпляр System.Net.Sockets.Socket можно использовать
			//     класс.
			enum AddressFamily
			{
				//
				// Сводка:
				//     Семейство неизвестных адресов.
				Unknown = -1,
				//
				// Сводка:
				//     Семейство неустановленных адресов.
				Unspecified = 0,
				//
				// Сводка:
				//     Локальный адрес узла UNIX.
				Unix = 1,
				//
				// Сводка:
				//     IP-адрес версии 4.
				InterNetwork = 2,
				//
				// Сводка:
				//     Адрес ARPANET: импорт пакетов УПРАВЛЕНИЯ.
				ImpLink = 3,
				//
				// Сводка:
				//     Адрес протоколов ДЕТЕНЫША.
				Pup = 4,
				//
				// Сводка:
				//     Адрес протоколов ХАОСА MIT.
				Chaos = 5,
				//
				// Сводка:
				//     Адрес протоколов Xerox NS.
				NS = 6,
				//
				// Сводка:
				//     Адрес IPX и SPX.
				Ipx = 6,
				//
				// Сводка:
				//     Адрес протоколов ISO.
				Iso = 7,
				//
				// Сводка:
				//     Адрес протоколов OSI.
				Osi = 7,
				//
				// Сводка:
				//     Адрес Европейской ассоциации производителей компьютера (ECMA).
				Ecma = 8,
				//
				// Сводка:
				//     Адрес протоколов Datakit.
				DataKit = 9,
				//
				// Сводка:
				//     Адреса протоколов CCITT, например X.25.
				Ccitt = 10,
				//
				// Сводка:
				//     Адрес IBM SNA.
				Sna = 11,
				//
				// Сводка:
				//     Адрес DECnet.
				DecNet = 12,
				//
				// Сводка:
				//     Адрес интерфейса прямого канала передачи данных.
				DataLink = 13,
				//
				// Сводка:
				//     LAT адрес.
				Lat = 14,
				//
				// Сводка:
				//     Адрес NSC Hyperchannel.
				HyperChannel = 15,
				//
				// Сводка:
				//     Адрес AppleTalk.
				AppleTalk = 16,
				//
				// Сводка:
				//     Адрес NetBios.
				NetBios = 17,
				//
				// Сводка:
				//     Адрес VoiceView.
				VoiceView = 18,
				//
				// Сводка:
				//     Адрес FireFox.
				FireFox = 19,
				//
				// Сводка:
				//     Адрес Banyan.
				Banyan = 21,
				//
				// Сводка:
				//     Адрес собственных служб ATM.
				Atm = 22,
				//
				// Сводка:
				//     Адрес для IP версии 6.
				InterNetworkV6 = 23,
				//
				// Сводка:
				//     Адрес кластерных продуктов корпорации Microsoft.
				Cluster = 24,
				//
				// Сводка:
				//     Адрес рабочей группы IEEE 1284.4.
				Ieee12844 = 25,
				//
				// Сводка:
				//     Адрес IrDA.
				Irda = 26,
				//
				// Сводка:
				//     Адрес шлюза поддержкой протоколов OSI конструкторы сети.
				NetworkDesigners = 28,
				//
				// Сводка:
				//     Адрес MAX.
				Max = 29
			};
		}
	}
}